CSI API ETABS v1

# cAreaObjGetElm Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetElm(
    	string Name,
    	ref int NElm,
    	ref string[] Elm
    )

    Function GetElm (
    	Name As String,
    	ByRef NElm As Integer,
    	ByRef Elm As String()
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim NElm As Integer
    Dim Elm As String()
    Dim returnValue As Integer

    returnValue = instance.GetElm(Name, NElm,
    	Elm)

    int GetElm(
    	String^ Name,
    	int% NElm,
    	array<String^>^% Elm
    )

    abstract GetElm :
            Name : string *
            NElm : int byref *
            Elm : string[] byref -> int

#### Parameters

Name

    Type: SystemString

NElm

    Type: SystemInt32

Elm

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com